<details>
  <summary>Apply for **diggerhq/digger_demo_envvars#dev**</summary>

  ```terraform
Terraform will perform the following actions:

  # aws_s3_bucket.test2 will be created
  + resource "aws_s3_bucket" "test2" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "delete-me-please-11-05-2023-12-51"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "Dev"
          + "Name"        = "My bucket"
        }
      + tags_all                    = {
          + "Environment" = "Dev"
          + "Name"        = "My bucket"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
aws_s3_bucket.test2: Creating...
aws_s3_bucket.test2: Creation complete after 2s [id=delete-me-please-11-05-2023-12-51]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.

  ```
</details>